In [ ]:
 # NBA

In [1]:
import pandas as pd

In [6]:
nba = pd.read_csv("nba.csv")
nba 

output = None

In [29]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [10]:
nba.shape

(458, 9)

In [12]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [13]:
nba.dtypes.value_counts()

object     5
float64    4
Name: count, dtype: int64

In [7]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [14]:
nba = pd.read_csv("nba.csv")
nba 

output = None

In [16]:
nba["Sport"] = "Football"

In [17]:
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Football
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Football
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Football
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,Football
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,Football
...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,Football
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,Football
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,Football
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,Football
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Football

In [18]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Football
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Football
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Football

In [36]:
nba = pd.read_csv("nba.csv")
nba 

output = None

In [37]:
nba.insert(4,column = "Sport", value = "Football")

In [38]:
nba.head(3)

,Name,Team,Number,Position,Sport,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,Football,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,Football,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,Football,27.0,6-5,205.0,Boston University,NaN

In [ ]:
 # revenue

In [3]:
revenue = pd.read_csv("revenue.csv")

revenue

      Date  New York  Los Angeles  Miami
0   1/1/16       985          122    499
1   1/2/16       738          788    534
2   1/3/16        14           20    933
3   1/4/16       730          904    885
4   1/5/16       114           71    253
5   1/6/16       936          502    497
6   1/7/16       123          996    115
7   1/8/16       935          492    886
8   1/9/16       846          954    823
9  1/10/16        54          285    216

In [4]:
revenue["New York"]

0    985
1    738
2     14
3    730
4    114
5    936
6    123
7    935
8    846
9     54
Name: New York, dtype: int64

In [19]:
rev= pd.read_csv("revenue.csv", index_col= "Date")

In [21]:
rev.head(3)

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933

In [22]:
rev.sum()

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [27]:
rev.sum(axis= "columns")

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [ ]:
 # CleanAce

In [19]:
cleanace = pd.read_csv("CleanAce.csv")
cleanace

output = None

In [20]:
cleanace ["Manager"] = "Segun Asoyinkule"

In [21]:
cleanace.head(3)

,Month,1st Avenue Sales,2nd Avenue Cash,Maryland Sales,Maryland Cash,Ogudu Sales,Ogudu Cash,4th Avenue Sales,5th Avenue Cash,Marina Sales,...,Victoria Island Cash,Lekki 1 Sales,Lekki 2 Cash,Ikosi Ketu Sales,Ikosi Ketu Cash,Chevron Sales,Chevron Cash,Abuja Sales,Abuja Cash,Manager
0,41275,4418253.56,3889895.0,3456562.3,3173755.0,1898188.25,1735210.0,1206761.2,779140.0,630519.25,...,0.0,0.0,0.0,0,0,0,0,0.0,0.0,Segun Asoyinkule
1,41306,4124033.00,4442853.0,3517797.0,3576122.0,1887387.00,1921310.0,876679.0,931505.0,601766.00,...,0.0,0.0,0.0,0,0,0,0,0.0,0.0,Segun Asoyinkule
2,41334,5118829.00,4890255.0,3897377.0,3814350.0,2035641.00,2003000.0,1208961.0,1141530.0,493573.00,...,0.0,0.0,0.0,0,0,0,0,0.0,0.0,Segun Asoyinkule

In [39]:
cleanace = pd.read_csv("CleanAce.csv")
cleanace

output = None

In [40]:
cleanace.insert(3, column= "Manager", value= "Segun")

In [41]:
cleanace.head(3)

,Month,1st Avenue Sales,2nd Avenue Cash,Manager,Maryland Sales,Maryland Cash,Ogudu Sales,Ogudu Cash,4th Avenue Sales,5th Avenue Cash,...,Victoria Island Sales,Victoria Island Cash,Lekki 1 Sales,Lekki 2 Cash,Ikosi Ketu Sales,Ikosi Ketu Cash,Chevron Sales,Chevron Cash,Abuja Sales,Abuja Cash
0,41275,4418253.56,3889895.0,Segun,3456562.3,3173755.0,1898188.25,1735210.0,1206761.2,779140.0,...,0.0,0.0,0.0,0.0,0,0,0,0,0.0,0.0
1,41306,4124033.00,4442853.0,Segun,3517797.0,3576122.0,1887387.00,1921310.0,876679.0,931505.0,...,0.0,0.0,0.0,0.0,0,0,0,0,0.0,0.0
2,41334,5118829.00,4890255.0,Segun,3897377.0,3814350.0,2035641.00,2003000.0,1208961.0,1141530.0,...,61000.0,0.0,0.0,0.0,0,0,0,0,0.0,0.0